[
  {
    "title": "Living Planet Symposium 2025",
    "description": "Held in Vienna (Austria), The Living Planet Symposium is a major event in the Earth Observation community, bringing together researchers, industry professionals, and policymakers to discuss the latest developments in the field. In this year's edition, taking place in Vienna on June 23-27, EOTDL will be present with the following activities:",
    "date": "2025-06-23",
    "dateTo": "2025-06-27",
    "link": "https://lps25.esa.int/"
  },
  {
    "title": "SmallSat Europe",
    "description": "Join 1,200+ space pioneers for two days of groundbreaking insights, innovation, and collaboration at SmallSat Europe, Europe’s leading technical and business small satellite conference. SmallSat Europe is a two-day conference which combines a technical conference (on three smaller simultaneous stages) with a large business conference focused on the latest industry trends. We are also planning on building the world’s largest SmallSat focused exhibition floor.",
    "date": "2025-05-27",
    "dateTo": "2025-05-28",
    "link": "https://2025.smallsateurope.com/"
  },
  {
    "title": "44th EARSeL Symposium",
    "description": "Held in Prague, this years edition consists of three key workshops: 8th Workshop on EO in the Global South; 3rd Workshop on Forestry; 3rd EARSeL Workshop on Agriculture",
    "date": "2025-05-26",
    "dateTo": "2025-05-29",
    "link": "https://symposium.earsel.org/44th-symposium-Prague/"
  },
  {
    "title": "Latitude 59",
    "description": "Latitude 59 is not just another tech conference. It’s a hub for entrepreneurs, investors, and innovators from around the world to connect, share ideas, and shape the future. Whether you’re a startup founder, a seasoned investor, or a tech enthusiast, Latitude 59 offers the perfect environment to grow your network and uncover groundbreaking opportunities. This year’s theme, “Innovating for a Better Tomorrow,” focuses on cutting-edge advancements in sustainability, AI, and digital transformation. Expect engaging keynotes, insightful panel discussions, and hands-on workshops led by global thought leaders.",
    "date": "2025-05-21",
    "dateTo": "2025-05-23",
    "link": "https://latitude59.ee/"
  },
  {
    "title": "Space Operations Summit",
    "description": "Space Operations Summit 2025 (21 – 22 May, 2025 in Copthorne Tara Hotel, London UK) is the only conference to look at space both as an independent operational domain, and as an enabler for joint all-domain operations. The conference brings together space professionals and senior military leaders who depend on space to deliver results in the air, on land, and at sea by providing a platform for stakeholders to simultaneously engage with launch service providers, defence space leaders, and end-user customers. Unlike other conferences on space, the conference agenda adopts a multifaceted approach which looks to solve challenges in space through the active participation of policy makers, militaries and industries.",
    "date": "2025-05-21",
    "dateTo": "2025-05-22",
    "link": "https://www.defenceiq.com/events-spaceoperations"
  },
  {
    "title": "Early Career Symposium",
    "description": "The Early Careers Symposium will provide early career professionals a venue to present novel research to peers and gaining presentation experience; Opportunities to discuss research findings in depth; Encouraging collaboration by sharing ideas and emerging technologies with peers. This is an official post-conference event of the Luxembourg Space Resources Week 2025 which is hosted from 19-21 May 2025.",
    "date": "2025-05-22",
    "dateTo": "2025-05-22",
    "link": "https://www.spaceresourcesweek.lu/early-career-symposium-2025"
  },
  {
    "title": "IRENE Workshop",
    "description": "Workshop to discuss advances in the International Radiation Environment Near-Earth modelling initiative.",
    "date": "2025-05-20",
    "dateTo": "2025-05-22",
    "link": "https://indico.esa.int/event/527/overview"
  },
  {
    "title": "Luxembourg Space Resources Week 2025",
    "description": "We bring together space agencies, business leaders, researchers and early-stage ventures. The event, like the subject, is truly multidisciplinary, addressing the science, technology, economic, legal and regulatory aspects of space resources. We are united by a shared vision: Towards the sustainable and responsible use of space resources for our future in space and on Earth. How we get there remains an open discussion. In this edition of Space Resources Week, we are interested in actions for the next 5 years and near-term priorities that will enable the realization of space resource utilization. In the coming years, we need to map resources, plan future architectures for and with space resources and develop roadmaps for translating ground-based research into space technology.",
    "date": "2025-05-19",
    "dateTo": "2025-05-21",
    "link": "https://www.spaceresourcesweek.lu/"
  },
  {
    "title": "Toulouse Space Festival",
    "description": "Discover the world of space as you’ve never seen it before. Let us take you on an unforgettable journey! The Toulouse Space Festival is coming back for a 2nd edition at the MEETT Exhibition Center and will bring together space enthusiasts, experts, and future leaders of the space industry. Whether you’re a student, a professional or simply curious about space, this event is for you!",
    "date": "2025-05-15",
    "dateTo": "2025-05-18",
    "link": "https://toulousespacefestival.com/"
  },
  {
    "title": "Vilnius Space Days 2025",
    "description": "Vilnius Space Days is an event designed to showcase the Lithuanian space ecosystem and its potential. Take part and discover exceptional opportunities in the space industry, discuss key space economy topics, and meet your potential partners. Discover the shortcut to space – one of the world’s fastest-growing sectors! On 6 May, at Vilnius Space Days we will present the opportunities in the space sector for business and science and prove that they are within our reach!",
    "date": "2025-05-06",
    "dateTo": "2025-05-06",
    "link": "https://lithuania.lt/events/solutions/vilnius-space-days-2025/"
  },
  {
    "title": "Space Optics Instrument Design & Technology SOIDT 2025",
    "description": "The European Space Agency took in 2015 the initiative to organize a course for professionals operating in the sector of optical engineering for  Space. Two types of courses are organized: one dedicated to space optics instrument design and the other space optics instrument technology. The two courses are organised alternatively, one per year. The SOIDT 2025 course is targeted at space optics instrument design. The team of lecturers consists of professionals with a long-standing experience in the sector. Their accessibility during the course, gives the participants a unique opportunity to deepen their knowledge with one-to-one meetings aside from the planned lectures. The venue hosting students and lecturers gives plenty of opportunities to develop a professional network. Sharing problems and discussing solutions together is the way to build a community of space optical engineers enabling and fostering growth in the space sector as a whole.",
    "date": "2025-05-11",
    "dateTo": "2025-05-16",
    "link": "https://atpi.eventsair.com/soidt2025"
  },
  {
    "title": "GEO Global Forum",
    "description": "The inaugural GEO Global Forum in 2025 will be a premier global event to inspire all elements of our society – from global leaders to citizens – to harness Earth Intelligence to empower informed and ambitious actions to ensure food security, restore ecosystems, prevent disasters, and confront the triple planetary crisis, transforming the Sustainable Development Goals into an achievable reality.",
    "date": "2025-05-05",
    "dateTo": "2025-05-09",
    "link": "https://earthobservations.org/about-us/events/geo-global-forum-2025"
  },
  {
    "title": "ESA – NASA International Workshop on AI Foundation Model for EO",
    "description": "This workshop on Foundation Model for Earth Observation and Earth Sciences aims to address these challenges by bringing together experts from AI, geospatial science, climate, weather and Earth observation communities. The goal is to foster interdisciplinary collaboration, share the latest research and technological advancements, and discuss practical solutions for effectively integrating FMs into the Earth Observation and Earth Sciences ecosystems. Topics to be covered include data curation, advancements in the AI architecture, fine-tuning, model evaluation, and challenges of integrating AI with geospatial digital twins, upstream and downstream applications. Additionally, the workshop will explore how Foundation Models can be leveraged in the context of commercial Earth Observation products and services, driving innovation in the private sector. Through this workshop, we aim to pave the way for the responsible and impactful use of AI in advancing our understanding of Earth’s systems and enhancing global environmental monitoring and response efforts.",
    "date": "2025-05-05",
    "dateTo": "2025-05-07",
    "link": "https://nikal.eventsair.com/cmspreview/nasa-esa-international-workshop-on-geospatial-ai-foundation-model-for-earth-observation-and-earth-sciences/"
  },
  {
    "title": "Rymdforum 2025",
    "description": "Rymdforum – The Swedish Space Conference 2025 is an international conference organized by the non-profit organization Rymdforum. The association´s aims and endeavors is to spread knowledge about Swedish and international space activities. Rymdforum 2025 is hosted by the City of Trollhättan and GKN Aerospace, in cooperation with University West and Innovatum Science Park. The conference will take place in Trollhättan, an hour away from Gothenburg. The proposed theme, ’Sweden – A New Space Era,’ aligns well with our industry and enables many exciting presentations conveying messages that resonate with Rymdforum’s objectives.",
    "date": "2025-05-04",
    "dateTo": "2025-05-06",
    "link": "https://www.rymdforum2025.se"
  },
  {
    "title": "SSEO15, 15th IAA Symposium on Small Satellites in Earth System Observation",
    "description": "The 15th IAA Symposium on Small Satellites for Earth System Observation offers a beneficial opportunity for scientists, engineers, and managers to share insights on current and upcoming programs and missions. The symposium will feature discussions on innovative mission objectives, as well as technological, management and programmatic aspects related to small satellites for Earth and Moon observation.",
    "date": "2025-05-04",
    "dateTo": "2025-05-08",
    "link": "https://iaa2025.welcome-manager.de/"
  },
  {
    "title": "ISPRS Geospatial Week 2025",
    "description": "As the hub of innovation, Dubai will proudly host the ISPRS Geo-Spatial Week (GSW 2025), bringing together the brightest minds in photogrammetry, remote sensing, and spatial sciences. On behalf of the Mohammed bin Rashid Space Centre (MBRSC), I am deeply honored to usher you into a week of exploration, collaboration, and inspiration. The theme of our conference, “Photogrammetry and Remote Sensing for a Better Tomorrow”, resonates profoundly with our collective mission. These are not just scientific domains but tools of transformation, enabling us to see our world from new perspectives, to make informed decisions, and to chart a course for a sustainable and inclusive future. By harnessing the precision of photogrammetry, the insights from remote sensing, and the encompassing knowledge of spatial sciences, we hold the keys to understanding our planet’s past, navigating its present, and shaping its future.",
    "date": "2025-04-06",
    "dateTo": "2025-04-11",
    "link": "https://gsw2025.ae/"
  },
  {
    "title": "Ignite Space 2025",
    "description": "Acting as a catalyst for commercial success, Ignite Space conference and exhibition 2025 will create opportunities for you and your business to engage with new customers, collaborators and investors within the UK space industry and its supply chain. Showcasing an industry worth more than £17.5bn to the UK economy, this event will accelerate growth and collaboration across the sector. All those working in, or who seek opportunities in, the UK space sector are welcome. We especially encourage SMEs in the space sector and businesses from sectors with space-applicable technologies to come along. Delegate tickets are free of charge and are limited so please only book your place if you can attend in person.",
    "date": "2025-02-05",
    "dateTo": "2025-02-06",
    "link": "https://www.ignite-space.co.uk/"
  },
  {
    "title": "17th European Space Conference",
    "description": "In 2025, the European space sector is set to experience significant developments as Europe commits to expand its space capabilities, cultivate a dynamic space ecosystem, and establish a strong presence in the global space arena amid an evolving international context. Building on the successes of the previous editions, this year’s European Space Conference will explore the current status of Europe’s space endeavours  through a series of high-level  dialogues and serve as a platform for in-depth, engaging, and forward-thinking discussions about the future direction of European space initiatives.    Participate in the dialogue, collaborate with policymakers, visionary leaders, and key industry figures, and influence the trajectory of the European space sector. Don’t miss the 17th European Space Conference.",
    "date": "2025-01-28",
    "dateTo": "2025-01-29",
    "link": "https://spaceconference.eu/"
  },
  {
    "title": "ESA Towards a Space-Powered Economy",
    "description": "Towards a Space-Powered Economy is a conference focusing on using space and space technologies to tackle the multiple challenges facing our societies, from climate change and urban growth to the energy transition and protecting the environment. The event will centre on harnessing the power of space to encourage cross-sector collaboration, share innovative financing solutions, and integrating sustainability with economic growth in a space-powered economy.",
    "date": "2024-11-25",
    "dateTo": "2024-11-26",
    "link": "https://www.spaceagenda.com/event/towards-a-space-powered-economy/"
  },
  {
    "title": "Secure World Foundation",
    "description": "Secure World Foundation and the Agência Espacial Brasileira (AEB) are partnering to organize the 2024 International Workshop on Space Resources: Perspectives for Future Ecosystems in São José dos Campos, Brazil.  This workshop will be a thematic follow-on to the 2023 International Workshop on Space Resources Perspectives of Emerging Space Programs which was organized by SWF and several Korean research institutes in November 2023.  Discussion at this event will focus on regional perspectives on the ways space resource activities will contribute to the future development of the space sector and its benefits.",
    "date": "2024-11-21",
    "dateTo": "2024-11-22",
    "link": "https://swfound.org/events/2024/2024-international-workshop-on-space-resources-perspectives-for-future-ecosystems"
  },
  {
    "title": "ISDE 10th Digital Earth Summit",
    "description": "The International Society for Digital Earth (ISDE), in collaboration with the University of Rwanda and the Rwanda Convention Bureau, is organising its 10th Digital Earth Summit, themed “Digital Intelligence to Sense our Planet and Sustain its Future” at the Kigali Conference and Exhibition Village, Kigali, Rwanda between 19 – 22 November 2024. Interested individuals are invited to submit an abstract that aligns with the following thematic areas.",
    "date": "2024-11-19",
    "dateTo": "2024-11-22",
    "link": "https://opportunities.spaceinafrica.com/call-for-abstracts-isdes-10th-digital-earth-summit/"
  },
  {
    "title": "Slush 2024",
    "description": "Slush is a not-for-profit organization on a mission to help and create founders to change the world. Based in Helsinki, Slush annually hosts the world’s leading startup event bringing together a curated crowd of European startups, world-class investors, and tech journalists. We stand by relevance over scale, bringing tangible value, and sharing actionable company-building advice. No fluff.",
    "date": "2024-11-20",
    "dateTo": "2024-11-21",
    "link": "https://slush.org/"
  },
  {
    "title": "2nd Annual Space Economy Summit",
    "description": "The space economy, now a vital backbone of global industries, demands strategies grounded in reality as well as rocket fuel for sustainable growth. The Economist’s 2nd annual Space Economy Summit will offer a uniquely high-profile forum for stakeholders to debate how we can maximise commercial and environmental returns to Earth from the final frontier. Building on the success of the first event of its kind in LA in October 2023 and held with the support of the Portuguese Space Agency, this international summit serves as a pivotal nexus for space sector leaders to converge with industry and a platform to share outcomes from new earth observation applications. Ad astra!",
    "date": "2024-12-04",
    "dateTo": "2024-12-05",
    "link": "https://events.economist.com/space-economy-summit/"
  },
  {
    "title": "ESA 35th Annual GRSG Conference and AGM",
    "description": "We’re thrilled to announce our return to ESA for our 2024 event. Mark your calendars for another fantastic event on all things geological remote sensing, with a side of italian hospitality! This year our key conference themes will be: Mine site closure and rehabilitation Climate and environmental monitoring applications ESA Special: Geological Remote Sensing using ESA Satellites  Other geological remote sensing topics that do not directly fit into the above themes will also be considered",
    "date": "2024-12-10",
    "dateTo": "2024-12-12",
    "link": "https://www.spaceagenda.com/event/esa-35th-annual-grsg-conference-and-agm/"
  },
  {
    "title": "NSE 2024",
    "description": "New Space Economy, expo and conference, was created in 2019 with the scope of becoming the international reference event on the new space economy challenges and perspectives, organized by Fiera Roma. With the 6th edition scheduled on 16-18 December, 2024 in Fiera Roma, the event offers three days of works, to discuss and cultivate new connections, exploring new collaborations within the space sector and beyond. The NSE 2024 format consists of an exhibition section, a main conference session completed by a rich networking and b2b program, and focuses on the ability of the new space economy to give rise, from space, to new terrestrial markets based on technological innovation. And these markets experience these days continuous evolution and offer unprecedented opportunities.",
    "date": "2024-12-16",
    "dateTo": "2024-12-18",
    "link": "https://www.nseexpoforum.com/"
  },
  {
    "title": "ESA VH-RODA 2024",
    "description": "The 5th Edition of the VH-RODA Workshop will provide an open forum (for the new space, commercial and institutional space sectors) to present and discuss about the current status and future developments related to Earth Observation (EO) data quality, calibration and validation of space-borne very high-resolution SAR, Optical, and, for the first time, atmospheric constellations, sensors and data products, with a dedicated focus on commercial EO data providers and related Cal/Val activities, synergies between optical, SAR and atmospheric communities, presentation of standards and best practices for data quality.",
    "date": "2024-12-02",
    "dateTo": "2024-12-06",
    "link": "https://earth.esa.int/eogateway/events/vh-roda"
  },
  {
    "title": "ESA 2nd Earth Observation Commercialisation Forum",
    "description": "Taking place at KAP Europa in Frankfurt (Germany), from 27 to 28 November 2024, end users, institutions, entrepreneurs and companies of any size from the Earth observation (EO) sector will come together to discuss the commercial potentials and challenges of the fast-growing EO commercial space sector.",
    "date": "2024-11-27",
    "dateTo": "2024-11-28",
    "link": "https://philab.esa.int/CommEO/"
  },
  {
    "title": "Space Tech Expo Europe",
    "description": "Welcome to Space Tech Expo Europe, the premier gathering for space professionals across the continent. Get ready to ignite your network, engage with top industry players, and discover the latest advancements in one convenient location. Join us for an unparalleled opportunity to elevate your expertise and forge meaningful connections in the dynamic world of space technology.",
    "date": "2024-11-19",
    "dateTo": "2024-11-21",
    "link": "https://www.spacetechexpo-europe.com/"
  },
  {
    "title": "World Space Business Week (WSBW) 2025",
    "description": "The World Space Business Week (WSBW)– the leading global business space event – brings together decision makers under the same roof for a week of deal-making and intense discussions shaping the future of the industry. For 27 years, the World Space Business Week (WSBW) has been a distinguished C-level executive summit, providing a quality platform for influential and forward-thinking leaders from international private and public organizations. This annual event serves as a hub for addressing critical industry issues, sharing insights and best practices, stimulating innovation, conducting business, and shaping the future of the sector. Widely acknowledged as the must-attend event by key industry players, the WSBW gathers future investors, innovators, clients, and partners under the same roof. It facilitates exchanges and deal-making for decision-makers from all over the world and the entire ecosystem, solidifying its position as an indispensable event in the industry for 27 years and counting.",
    "date": "2025-09-15",
    "dateTo": "2025-09-19",
    "link": "https://wsbw.com/"
  },
  {
    "title": "EUMETSAT Meteorological Satellite Conference 2025",
    "description": "The 2025 EUMETSAT Meteorological Satellite Conference will take place in Lyon, France on 15 – 19 September. EUMETSAT will be joined in the organisation and hosting of the event by Météo-France, the national weather and climate services provider in France. Over the years, the EUMETSAT user conference has become a key annual event for the meteorological and scientific communities where participants from around the world can meet to share their experience and knowledge during plenary, poster and workshop sessions. The overarching theme of the conference is “From Space to Safety: Earth Observation for Future Weather and Climate Preparedness”.",
    "date": "2025-09-15)",
    "dateTo": "2025-09-19",
    "link": "https://www.eumetsat.int/eumetsat-meteorological-satellite-conference-2025"
  },
  {
    "title": "European Microwave Week EuMW 2025",
    "description": "The 28th edition of the European Microwave Week (EuMW 2025) will come to Utrecht to continue the annual series of highly successful microwave events that started back in 1998. EuMW 2025 comprises three co-located conferences.",
    "date": "2025-09-21",
    "dateTo": "2025-09-26",
    "link": "https://www.eumw.eu/"
  },
  {
    "title": "German Aerospace Congress",
    "description": "The German Aerospace Congress (DLRK) 2025 is a premier interdisciplinary event bringing together scientists and professionals from all aerospace disciplines to discuss cutting-edge research and industry developments. The congress features a broad range of technical sessions, where experts will explore key topics shaping the future of aerospace.",
    "date": "2025-09-23",
    "dateTo": "2025-09-25",
    "link": "https://www.dlr.de/en/pt-lf/news/events/2025/german-aerospace-congress-2025"
  },
  {
    "title": "Space Generation Congress SGC 2025",
    "description": "On behalf of the Space Generation Congress SGC 2025 Organising Team, we are pleased to welcome you in Sydney to join us for the 23rd SGC. The annual SGC brings together delegates and colleagues from government, industry, academia, policy-makers, and entrepreneurs to debate and discuss issues affecting our fast-growing sector. The Space Generation Congress is only open to students and young professionals aged 18-35, who have successfully applied through SGAC and/or been given a scholarship seat by one of our partners. Applications for SGC 2025 will open soon. Keep an eye on the SGAC news page and social media for updates and how to apply!",
    "date": "2025-09-25",
    "dateTo": "2025-09-27",
    "link": "https://spacegeneration.org/call-for-23rd-space-generation-congress-sgc-organising-team"
  },
  {
    "title": "32nd IAF Workshop – Resilient Coasts, Resilient Earth",
    "description": "Held in conjunction with IAC 2025, the 32nd IAF Workshop brings together government officials, marine and space experts, civil protection authorities, NGOs, academia, and industry leaders to address one of Earth’s most urgent challenges: building coastal resilience through space-based solutions.\n🔹 Workshop Theme: Resilient Coasts, Resilient Earth: Innovative Space Solutions for Coastal Resilience and Emergency Management\n🔹 Key Topics & Objectives:\n✅ Highlight the synergies between space for oceans and disaster-risk reduction\n✅ Promote the use of EO, digital twins, GeoAI, IoT, and cloud platforms for coastal and emergency applications\n✅ Showcase pilot projects and case studies supporting SDG 13 (Climate Action) and SDG 14 (Life Below Water)\n✅ Facilitate new partnerships—especially for Small Island Developing States (SIDS) and Least Developed Countries (LDCs)\n✅ Raise awareness of the UN-SPIDER program and other capacity-building efforts\n",
    "date": "2025-09-26",
    "dateTo": "2025-09-28",
    "link": "https://www.iafastro.org/events/iac/international-astronautical-congress-2025/associated-events/iaf-workshop-with-support-of-united-nations.html"
  },
  {
    "title": "International Astronautical Congress IAC 2025",
    "description": "The 76th International Astronautical Congress (IAC) is coming to Sydney, Australia and the countdown has begun! This prestigious event is where the world’s space community gathers to access the latest advancements and trends, academic works, industry connections, and partnership opportunities. IAC 2025 in Sydney, Australia is hosted by Space Industry Association of Australia (SIAA) and co-hosted by Australian Space Agency and NSW Government. This will be the third time Australia has hosted the IAC, with previous events held in Melbourne in 1998 and Adelaide in 2017. The 76th IAC in Sydney in 2025 presents a generational opportunity to showcase the rapid progress of Australia’s space industry and the importance of space-enabled services to the Australian way of life. The event will highlight Australia’s commitment to learning from indigenous knowledges and collaborating with First Nations communities on the deployment and use of space technologies. The event will broaden the influence and relevance of space to adjacent industries, including emergency services, health, utilities, telecommunications, resources, manufacturing, finance, construction, agriculture, and Smart Cities. It will delve into why space is critical for both businesses and our everyday lives. IAC 2025 aims to advance space in the Indo-Pacific by showcasing the entire region and its wide variety of space-based opportunities.",
    "date": "2025-09-28",
    "dateTo": "2025-10-03",
    "link": "https://www.iac2025.org/"
  },
  {
    "title": "NL Space Week 2025",
    "description": "NL Space Week is powered and initiated by NL Space Campus in collaboration with ESA ESTEC, and supported by many space partners. NL Space Week demystifies space by opening the doors for everyone interested in anything that has to do with space. Visitors, businesses, investors and attendees will grow their knowledge, discover how space technology and data impacts society for the better and accelerate innovations. During NL Space Week the entire Dutch space region will be centred around space activities. Events vary from open days where space organisations like SRON and ESA open their doors to the public, to network events that grow your knowledge, activities for families, to business events for investors, businesses, and policy makers.",
    "date": "2025-10-04",
    "dateTo": "2025-10-12",
    "link": "https://www.nlspacecampus.eu/nlspaceweek/"
  },
  {
    "title": "9th Asia-Pacific Conference on Synthetic Aperture Radar APSAR 2025",
    "description": "The Asia-Pacific Conference on Synthetic Aperture Radar (APSAR) is an international conference devoted to SAR technology development and applications and Co-Sponsored by Institute of Electronics, Information and Communication Engineers (IEICE), Japan and IEEE Geosciences and Remote Sensing Society (GRSS). The APSAR is a forum of Synthetic Aperture Radar (SAR) engineers and scientists from all over the world, especially from the Asia-Pacific region. The bi-annual APSAR conference is held every two years in China, Japan, Korea, Australia, and Singapore in turn, and The 9th Asia-Pacific Conference on Synthetic Aperture Radar was n",
    "date": "2025-10-05",
    "dateTo": "2025-10-09",
    "link": "https://apsar2025.ce.t.kyoto-u.ac.jp/"
  },
  {
    "title": "European Data Handling & Data Processing Conference EDHPC 2025",
    "description": "The EDHPC will be an international forum covering diverse aspects of the most relevant topics for on-board computers, on-board data handling systems, on-board data processing and microelectronics for space applications including both platform and payload applications (RF and optical). The main objectives are: To bring together and foster cooperation between different experts in the areas of space data handling, data processing, and microelectronics components. To discuss architectures / reference designs / microelectronics component developments / performance of current and future data handling – data processing hardware for space. To establish closer links between industry and international / national space agencies, to enable further developments in these fields",
    "date": "2025-10-13",
    "dateTo": "2025-10-17",
    "link": "https://atpi.eventsair.com/edhpc-2025"
  },
  {
    "title": "Meteorological Technology World Expo 2025",
    "description": "Meteorological Technology World Expo is the leading global event for meteorological, hydromet, metocean, and environmental monitoring technologies and services. Attracting over 150 exhibitors and thousands of attendees from more than 100 countries, it is the largest exhibition of its kind worldwide. The expo draws buyers and users from national meteorological and hydrological services, environmental agencies, research institutes and weather-critical industries such as aviation, maritime, agriculture, transportation and renewable energy. It’s a must-attend event for discovering cutting-edge technologies, meeting new suppliers and networking within the industry.",
    "date": "2025-10-14",
    "dateTo": "2025-10-16",
    "link": "https://meteorologicaltechnologyworldexpo.com/"
  },
  {
    "title": "Czech Space Week 2025",
    "description": "Czech Space Week 2025 will span from October 20 to October 26 across multiple venues in the Czech Republic. This event stands as the largest and most comprehensive space festival in the country, uniting companies, startups, academics, and government stakeholders under a singular mission. Since its establishment in 2018, Czech Space Week has evolved into a critical platform designed to accelerate innovation, collaboration, and investment within the Czech and broader European space sectors.",
    "date": "2025-10-20",
    "dateTo": "2025-10-26",
    "link": "https://www.czechspaceweek.com/en/"
  },
  {
    "title": "7th SWF Summit for Space Sustainability",
    "description": "Join us in Paris, France on 22–23 October 2025 for the 7th Summit for Space Sustainability, co-hosted by the Secure World Foundation (SWF), the Centre National d’Études Spatiales (CNES), and the French Government. This high‑level, multi‑day international forum focuses on developing concrete solutions to sustain safe, secure, and peaceful uses of outer space",
    "date": "2025-10-22",
    "dateTo": "2025-10-23",
    "link": "https://www.swfsummit.org/"
  },
  {
    "title": "Satellite Innovation 2025",
    "description": "Satellite Innovation takes place during the first two days of Silicon Valley Space Week during the final week of October. This event provides an unparalleled opportunity to connect, learn, and participate in the advancement of the space industry. Held in the heart of Silicon Valley, it’s a pivotal conference for those passionate about shaping the industry’s future. Join to engage with industry leaders, gain valuable insights, and forge meaningful connections that drive innovation and success.",
    "date": "2025-10-27",
    "dateTo": "2025-10-28",
    "link": "https://svsw.events/"
  },
  {
    "title": "International School on Space Optics ISSO 2025",
    "description": "The International School on Space Optics is an event that targets to serve the community of young engineers and scientists who are already active or have the aspiration to work in the field of Spaceborne Optics. It offers an intensive 5-days immersion program of lectures, design project and visits to space-related facilities. The course can be seen as a “compressed” 1-year class on Space Optics which would have been part of a Master Program in Spaceborne Technologies and Applications. It will allow 360 degrees exposure to all disciplines or optical engineering in space. A Certificate of Attendance will be provided to any participant that has been present consistently throughout the Course. The first ISSO was organised as a “Winter College on Space Optics” in February 2015 at the UNESCO International Centre for Theoretical Physics – ICTP within the frame of the “2015-International Year of Light”.  Following this event it was decided to establish the ISSO as a systematic biannual event. In 2017 the ISSO was hosted at ESTEC. In 2019 the ISSO was hosted at ENEA in Rome, Italy. And ISSO 2021 was hosted online. In 2025 the School will be held only physically in ESTEC with no option for on-line attendance.",
    "date": "2025-10-27",
    "dateTo": "2025-10-31",
    "link": "https://atpi.eventsair.com/isso-2025"
  },
  {
    "title": "European Space Weather Week ESWW 2025",
    "description": "The 21st edition of the major international conference, European Space Weather Week ESWW 2025 will take place in Umeå in the autumn of 2025. The event is expected to attract at least 500 participants from diverse sectors around the world, including academia, industry and governmental agencies. The ESWW will mainly be organised by Umeå University with the help of Umeå Congress and a national scientific team. “Umeå University is honoured to have been selected to host this prestigious event. The ESWW is an important platform for sharing knowledge, discussing the latest research, and exploring new frontiers in space weather and space climate forecasting and technology,” says Audrey Schillings, chair of the organising committee. The ESWW aims to foster interdisciplinary collaboration and investigation of new technologies and approaches, such as machine learning, in a space weather and space climate context. The event is highly interdisciplinary and brings scientists together with space industries and actors interested in space weather and space climate. A diverse range of events will mark the conference, including a summer school for students and early-career scientists, an exhibition fair, and engaging activities designed for children and the public. The conference is scheduled for October 27 to 31, 2025, marking the first occasion this annual gathering will be hosted in Sweden.",
    "date": "2025-10-27",
    "dateTo": "2025-10-31",
    "link": "https://visitumea.se/en/esww2025-european-space-weather-week"
  },
  {
    "title": "Software Defined Space Conference SDSC 2025",
    "description": "The fifth instalment of the “Software Defined Space Conference” (SDSC) series, dedicated to the critical realm of cybersecurity in space, is set to unfold 28-30 October 2025 in Tallinn, Estonia. Through the use of software, we have the capability to transform how we utilise and gain benefits from our space assets. We can accurately predict and visualise future demands, while also facilitating the coming together of service providers and consumers. It’s important to recognise that the increased value of space technologies today is primarily driven by software advancements and the expanding realm of connectivity. In 2022, the space sector entered a new era in which cyber security assumed a pivotal role in ensuring the uninterrupted provision of services and overall sustainability. Hence, the primary focus of this event centres around two key areas: software development and cyber security within the realm of space technology. The overarching goal is to heighten awareness about the potential of these technologies, explore avenues for commercialisation, and foster the growth of the space community.",
    "date": "2025-10-28",
    "dateTo": "2025-10-30",
    "link": "https://sdsc.ee/"
  },
  {
    "title": "Security for Space Systems (3S)",
    "description": "2025 Security for Space Systems (3S) Conference aims at bringing together academia and industry to present cutting-edge research and innovations in space systems security. After the success of its inaugural edition, the 2025 conference will expand to include two review cycles and extend to two and a half days, ensuring ample time for in-depth discussions and engagement, to exchange knowledge on the latest security challenges and solutions for space. In addition to the conference, there will be an industrial exhibition where European companies specializing in space systems security are invited to demonstrate their products through equipment displays or informative posters. This exhibition will offer a unique opportunity to connect with industry professionals, researchers, and stakeholders from the broader security community. The Security for Space Systems 2025 will be held in November 2025 at the European Space Research and Technology Centre (ESTEC) in Noordwijk, the Netherlands.",
    "date": "2025-11-04",
    "dateTo": "2025-11-06",
    "link": "https://security4space.esa.int/2025/"
  },
  {
    "title": "Model-Based Space Systems and Software Engineering MBSE 2025",
    "description": "Welcome to the Model-Based Space Systems and Software Engineering Workshop MBSE 2025 Model-Based Space Systems and Software Engineering (MB4SE) workshop is heading to Lithuania in 2025! 🚀 With the support of the MB4SE Advisory Group, and Sensmetry, this prestigious event will further strengthen the Model-Based Systems Engineering (MBSE) community across the European space domain. And what better place to host it than Vilnius – the vibrant capital of one of ESA’s Associated Member States! \n📅 Save the Date: 5-7, November 2025\n📍 Where: Vilnius, Lithuania",
    "date": "2025-11-05",
    "dateTo": "2025-11-07",
    "link": "https://lithuania.lt/events/solutions/model-based-space-systems-and-software-engineering-mbse-2025/"
  },
  {
    "title": "Africa Tech Festival 2025",
    "description": "The new edition of the Africa Tech Festival puts African Tech on the Global Stage! Uniting global technology and telecom leaders, entrepreneurs, and policymakers to drive digital transformation and innovation across Africa. 11-13 Nov: Expo & Content Sessions. 10-13 Nov: VIP & Partner Events Africa Tech Festival provides a 360 view of how tech and strategy evolution is reshaping Africa’s diverse industry sectors – from telecoms, financial services, healthcare, government, SME and start-ups, retail, manufacture and beyond. Expect world-class speakers, industry leading content, two international exhibitions, and outcome-driven networking focussed on how tech integration is delivering real-world impact through enterprise excellence and socioeconomic development. For 27 years, we’ve been a forum for conversations, connections, and celebration exploring how innovation is addressing humanity’s most pressing challenges while elevating African tech onto the global stage.",
    "date": "2025-11-10",
    "dateTo": "2025-11-13",
    "link": "https://africatechfestival.com/"
  },
  {
    "title": "Startup Startcamp Bremen SPACE",
    "description": "STARTUP STARTCAMP BREMEN SPACE is designed for those who are interested to (co-)start a SPACE, SPACE-ENABLED, or SPACE-RELATED startup: Transform a space or space-enabled or space-related startup idea in just 54 hours! Pitch your idea in 60 seconds (no slides) or join an idea that you are passionate about. Find awesome like-minded people, grow your network & learn new skills. Test your assumptions, conduct market research, tune your business model, develop your demo or prototype. On Sunday, pitch your startup concept to a jury & public audience, get feedback – and maybe your own startup will be born this weekend!",
    "date": "2025-11-14",
    "dateTo": "2025-11-16",
    "link": "https://www.eventbrite.de/e/startup-startcamp-bremen-space-tickets-1049470543647"
  },
  {
    "title": "Space Tech Expo Europe 2025",
    "description": "Welcome to Space Tech Expo Europe, the premier gathering for space professionals across the continent. Get ready to ignite your network, engage with top industry players, and discover the latest advancements in one convenient location. Join us for an unparalleled opportunity to elevate your expertise and forge meaningful connections in the dynamic world of space technology.",
    "date": "2025-11-18",
    "dateTo": "2025-11-20",
    "link": "https://www.spacetechexpo-europe.com/"
  },
  {
    "title": "In2Space Forum 2025",
    "description": "The In2Space Forum is a landmark conference focused on unlocking terrestrial innovation through satellite technologies, including remote sensing, navigation, telecommunications, and AI-powered data services. Set in Riyadh, it brings together global space leaders, innovators, satellite developers, infrastructure providers, and government stakeholders to explore space-enabled solutions for real-world challenges. \n🔹 Conference Features:\n✅ High-level Panels & Keynotes – Featuring leaders from NASA, UNOOSA, AfSA, WMO, IEEE-GRSS, NOAA, and more\n✅ Technical Workshops – Addressing remote sensing gaps, AI for multi-source data fusion, and new mission planning\n✅ AI & Data Fusion Roundtables – Strategies for managing data volume, speed, and interoperability\n✅ Technology Exhibition – Explore innovations in upstream/downstream satellite tech and infrastructure\n✅ CEO Roundtables & Strategy Sessions – Invite-only decision-maker dialogues for strategic space development\n🔹 Target Sectors:\nAgriculture, water & air quality monitoring. Urban planning & infrastructure. Maritime & security surveillance. Insurance & disaster risk assessment",
    "date": "2025-11-24",
    "dateTo": "2025-11-25",
    "link": "https://in2space.me/"
  },
  {
    "title": "Space-Comm Expo Scotland",
    "description": "Space-Comm Expo Scotland at SEC Glasgow is the new catalyst for one of the world’s leading space nations at the forefront of the UK’s global ambitions. The Scottish space industry is thriving and one of the fastest growing in Europe. Glasgow designs and builds more small satellites than anywhere outside of California. Scotland is home to five spaceports aiming to be a strategic launchpad for the northern hemisphere with multiple launch vehicle operators. Scotland is famous for world class downstream data capabilities, technology for deep space missions and is home to over 150+ space companies with the sector underpinned by government, business, clusters and universities. Space-Comm Expo Scotland is supported by the Scottish Government, UK Space Agency, UKspace, Scottish Enterprise, South of Scotland Enterprise, Highlands and Islands Enterprise and Space Scotland with plans to attract international delegations and visitors from across Europe and the global space community, alongside Primes, SMEs and Start-Ups. Space-Comm Expo Scotland will follow the award-winning format of previous events with Scottish based companies to the fore alongside international exhibitors, product demonstrations, keynote speakers, multiple conference theatres, roundtables and 1-2-1 networking opportunities.",
    "date": "2025-12-03",
    "dateTo": "2025-12-04",
    "link": "https://space-comm-scotland.co.uk/"
  },
  {
    "title": "NSE ExpoForum 2025 – New Space Economy",
    "description": "The 7th edition of NSE ExpoForum is Europe’s benchmark event for the New Space Economy, bringing together a dynamic ecosystem of industry leaders, startups, institutions, researchers, and students. Hosted at Fiera di Roma, this three-day event fosters strategic dialogue and innovation across the entire space value chain—from Earth observation and satellite constellations to lunar missions, sustainability, and AI applications. \n🔹 What to Expect:\n✅ Exhibition Hall – Explore leading technologies from space companies, institutions, and startups\n ✅ High-Level Scientific Conference – Curated by a distinguished scientific committee, tackling frontier topics across materials, AI, satellite services, and planetary exploration\n ✅ TechTables – Dedicated think tanks for project incubation and strategic collaboration\n ✅ NSE Pitch Competition – Recognizing the most innovative startups in the space sector\n ✅ NSE Arena – Live demos, product showcases, and dynamic talks from industry experts\n ✅ Networking & B2B Matchmaking – A hub for new collaborations with global stakeholders\n ✅ Educational Hub – Workshops, career events, and training sessions to inspire the next generation of space professionals",
    "date": "2025-12-10",
    "dateTo": "2025-12-12",
    "link": "https://www.nseexpoforum.com/"
  }
]